Revit 2027 API
ParameterTypeId.RebarShapeTypeAtStart Property
 "Type At Start"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId RebarShapeTypeAtStart { get; }
Public Shared ReadOnly Property RebarShapeTypeAtStart As ForgeTypeId
	Get
public:
static property ForgeTypeId^ RebarShapeTypeAtStart {
	ForgeTypeId^ get ();
}
static member RebarShapeTypeAtStart : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace